/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №1
Завдання 1
Тема лабораторної роботи: Розв'язання задач лінійної структури.
Завдання: Розробити програму мовою С\С++ для відображення заданого зображення 
відповідно варіанту індивідуального завдання, що наведено у таблиці 1.1. 
Для різних елементів зображення використати різні кольори. Зображення має 
бути в стилі японського кросворду. Розмір зображення не менше 10 на 10 символів.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

// Функція, призначена для визначення позиції курсору на екрані за координатами x, y
void gotoxy(int x, int y) {
	// змінна, яка позначає нову позицію курсору на екрані виводу
	COORD coordinates;
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	coordinates.X = x; coordinates.Y = y;
	// задання позиції курсору на екрані
	SetConsoleCursorPosition(hStdOut, coordinates);
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	// зміна кольору тла і тексту на екрані виводу (тут відповідно - чорний і білий)
	system("color 07"); 
	
	/*Програмний код для розв'язку поставленого завдання*/
	
	// наступні дві змінні визначають початкові координати курсору на екрані
	int x=2;
	int y=2;
	
	// Зображуємо задній гвинт
	SetColor(8, 8);
	gotoxy(x+1, y);
	cout<<"====";
	gotoxy(x, y+1);
	cout<<"=";
	gotoxy(x+5, y+1);
	cout<<"=";
	gotoxy(x, y+2);
	cout<<"=";
	SetColor(8, 0);
	gotoxy(x+2, y+2);
	cout<<"()";
	SetColor(8, 8);
	gotoxy(x+5, y+2);
	cout<<"=";
	gotoxy(x, y+3);
	cout<<"=";
	gotoxy(x+5, y+3);
	cout<<"=";
	gotoxy(x+1, y+4);
	cout<<"====";
	
	// Зображуємо верхній гвинт
	SetColor(8, 8);
	gotoxy(x+16, y+1);
	cout<<"=============================";
	gotoxy(x+30, y+2);
	cout<<"H";
	
	// Зображуємо хвостову частину
	SetColor(2, 0);
	gotoxy(x+6, y+4);
	cout<<"\\";
	gotoxy(x+7, y+4);
	cout<<"_____________";
	SetColor(2, 0);
	gotoxy(x+4, y+5);
	cout<<"\\";
	SetColor(2, 2);
	gotoxy(x+5, y+5);
	cout<<"_______________";
	SetColor(2, 0);	
	gotoxy(x+20, y+6);
	cout<<"\\";
	gotoxy(x+20, y+4);
	cout<<"/";
	
	// Зображуємо лобове скло
	SetColor(3, 0);	
	gotoxy(x+40, y+4);
	cout<<"\\";
	gotoxy(x+41, y+5);
	cout<<"\\";
	gotoxy(x+34, y+4);
	cout<<"| | |";
	gotoxy(x+34, y+5);
	cout<<"| | | |\\";
	
	// Зображуємо кабіну
	SetColor(2, 0);
	gotoxy(x+21, y+3);
	cout<<"________//";
	gotoxy(x+31, y+3);
	cout<<"\\________";
	SetColor(2, 2);
	gotoxy(x+30, y+3);
	cout<<"H";
	gotoxy(x+21, y+4);
	cout<<"=============";
	SetColor(2, 2);
	gotoxy(x+20, y+5);
	cout<<"==============";
	gotoxy(x+21, y+6);
	cout<<"======================";
	SetColor(2, 0);	
	gotoxy(x+43, y+6);
	cout<<"\\";
	gotoxy(x+21, y+7);
	cout<<"\\";
	SetColor(2, 2);
	gotoxy(x+22, y+7);
	cout<<"======================";
	
	// Зображуємо шассі
	SetColor(8, 0);
	gotoxy(x+22, y+8);
	cout<<"  //               \\";
	gotoxy(x+23, y+9);
	cout<<"ОО                 О";
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0); 
	cout << "\n\n\n";
	system("pause");
	
	return 0;
}
