/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №5
Завдання 2
Тема лабораторної роботи: Розв'язання задач з використанням циклу з післяумовою.
Завдання: Розробити алгоритм для підрахунку сум та добутків, 
відповідно до індивідуального завдання, що наведено у таблиці 5.2, та реалізувати його мовою 
С\С++ з використанням циклу DO – WHILE. Значення параметрів та змінних для обрахунків сум та 
добутків задавати з клавіатури. Результат вивести різними кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>

#define _USE_MATH_DEFINES

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	double x, y, g1=0.0, g2=1.0, G;
	int i_start, i_end, j_start, j_end;
	
	SetColor(11, 1);
	cout << "Введіть початкове значення i: ";
	cin >> i_start;
	cout <<"Введіть кінцеве значення i: ";
	cin >> i_end;
	cout <<"Введіть x: ";
	cin >> x;
	
	SetColor(11, 9);
	cout <<"Введіть початкове значення j: ";
	cin >> j_start;
	cout <<"Введіть кінцеве значення j: ";
	cin >> j_end;

	tryAgain: // мітка, перехід до якої відбувається в разі, якщо y == 0, 180, 360 і т.п.
		SetColor(11, 9);
		cout <<"Введіть значення y (крім 0, Pi*k): ";
		cin >> y;
	
	if (fmod(sin(y), M_PI) == 0) {
		// якщо y == 0, 180, 360 і т.п., переходимо до мітки tryAgain, бо sin(y) в такому випадку 
		// дорівнює 0, а на нуль ділити не можна
		SetColor(15, 4);
		cout << "Значення y не повинне дорівнювати 0\nабо бути кратним числу Pi! Спробуйте ще раз\n" << endl;
		goto tryAgain;
	}
	
	int i = i_start;
	int j = j_start;
	
	do {
		g1 += x * i;
		i++;
	} while (i <= i_end);
	
	do {
		g2 *= log(fabs(cos(j)));
		j++;
	} while (j <= j_end);
	
	G = g1 - g2/sin(y);
	
	SetColor(0, 2);
	printf("G = %10.8f\n", G);
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
