/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №2
Завдання 3
Тема лабораторної роботи: Розв'язання задач розгалуженої структури.
Завдання: Розробити алгоритм для розв'язання індивідуальних задач з використанням switch та 
реалізувати його мовою С\С++ відповідно до індивідуального завдання, що наведено у таблиці 2.3. 
Результат вивести різними кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	int choice; // змінна для вибору типу заняття
	
	SetColor(1, 14);
	cout << "Є 4 типи занять:        " << endl;
	SetColor(9, 14);
	cout << "1) Лекція               " << endl; 
	cout << "2) Практичне            " << endl;
	cout << "3) Семінар              " << endl;
	cout << "4) Лабораторна          " << endl;
	
	SetColor(1, 14);
	cout << "Виберіть номер заняття: "; 
	cin >> choice;
	
	switch(choice) {
		case 1: 
			SetColor(choice, choice + 10);
			cout << "Лекція"; 
			break;
		case 2: 
			SetColor(choice, choice + 2);
			cout << "Практичне"; 
			break;
		case 3: 
			SetColor(choice, choice + 4);
			cout << "Семінар"; 
			break;
		case 4: 
			SetColor(choice, choice + 5);
			cout << "Лабораторна"; 
			break;
		default: 
			SetColor(0, 4);
			cout << "Заняття с таким номером не існує!";
			break;
	}
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
