/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №4
Завдання 2
Тема лабораторної роботи: Розв'язання задач з використанням циклу з передумовою.
Завдання: Розробити алгоритм та реалізувати його мовою С\С++ для підрахунку суми елементів 
нескінченного ряду, відповідно до індивідуального завдання у таблиці 4.2. Обчислення припинити, 
як тільки поточний елемент буде менше або дорівнювати заданій точності. Дослідити як впливає 
точність на кількість доданків. Точність задавати з клавіатури. Результат вивести різними 
кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	double y, e, s = 0.0;
	int i, x;
	
	SetColor(11, 1);
	cout << "Введіть точність e (0 < e < 1): ";
	cin >> e;
	cout << "Bведіть x: ";
	cin >> x;
	cout << "Bведіть i (i != 1): ";
	cin >> i;
	
	y = double(x / pow(i - 1, i));
	s = y;
	
	while(y >= e) {
		i++;
		y = double(x / pow(i - 1, i));
		s += y;		
	}
	
	SetColor(0, 4);
	printf("S = %10.7f n = %d\n", s, i);
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
