/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №2
Завдання 2
Тема лабораторної роботи: Розв'язання задач розгалуженої структури.
Завдання: Розробити алгоритм для розв'язання індивідуальних задач та реалізувати його мовою С\С++ 
відповідно до індивідуального завдання, що наведено у таблиці 2.2. Необхідно розробити два варіанта 
реалізації задачі з використанням умовного оператору та тернарного оператору. 
Результат вивести різними кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	// зміна кольору тла і тексту на екрані виводу (тут відповідно - чорний і білий)
	system("color 07"); 
	
	/* Програмний код для розв'язку поставленого завдання */
	
	double a, b, c, Y;
	int choice; // змінна для вибору варіанту виконання задачі
	
	tryAgain: // мітка для переходу за оператором goto (якщо вибір варіанту невірний)
		SetColor(15, 8);
		cout << "1) Використання умовного оператора                   " << endl;
		cout << "2) Bикористання тернарного оператора                 " << endl;
		cout << "Виберіть варіант виконання задачі (введіть 1 або 2): ";
		cin >> choice;
		
		/*Варіант 1 (використання умовного оператора)*/
		if (choice == 1) {
			SetColor(0, 7);
			cout << "Введіть довжину першої сторони трикутника: ";
			cin >> a;
			cout << "Введіть довжину другої сторони трикутника: ";
			cin >> b;
			cout << "Введіть довжину третьої сторони трикутника: ";
			cin >> c;
			
			if (powf(c, 2.0) == powf(a, 2.0) + powf(b, 2.0)) {
				SetColor(15, 2);
				cout << "Трикутник прямокутний";		
			} else {
				SetColor(15, 4);
				cout << "Трикутник не є прямокутним";
			}
		
		/*Варіант 2 (використання тернарного оператора)*/
		} else if (choice == 2) {
			SetColor(0, 7);
			cout << "Введіть довжину першої сторони трикутника: ";
			cin >> a;
			cout << "Введіть довжину другої сторони трикутника: ";
			cin >> b;
			cout << "Введіть довжину третьої сторони трикутника: ";
			cin >> c;
			
			bool pythagorean = powf(c, 2.0) == powf(a, 2.0) + powf(b, 2.0); // змінна, що містить результат виконуваності теореми Піфагора
			
			SetColor(15, pythagorean ? 2 : 4);
			cout << (pythagorean ? "Трикутник прямокутний" : "Трикутник не є прямокутним");
			
		} else {
			SetColor(0, 4);
			cout << "\nВи зробили неправильний вибір! Спробуйте ще раз\n";
			goto tryAgain; // якщо вибір варіанту виконання невірний, переходимо на мітку tryAgain та вибираємо варіант спочатку
		}
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
