/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №8
Завдання 2
Тема лабораторної роботи: Розв’язання задач обробки символьних рядків.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ для обробки слова або символьного рядка, що оголошено з 
використанням типу даних string, у відповідності до індивідуального завдання заданого у таблиці 8.2. Результат вивести різними кольорами.

У заданому символьному рядку для кожного слова перевірити чи його 5-й символ в ньому буква, то замінити його на символ “5”. В іншому 
випадку залишити текст без зміни.
*/

#include <iostream>
#include <windows.h>
#include <string>
#include <vector>
#include <cctype>
#include <sstream>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у консольному вікні
	SetConsoleCP(1251); // встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleOutputCP(1251); // встановлення кодової сторінки win-cp 1251 до потоку виведення
	
	/* Програмний код для розв'язку поставленого завдання */
	string str;	
	string word;
	vector<string> words;
	int i;
	
	SetColor(11, 1);
	cout << "Введіть речення: ";
	getline(cin, str); // зчитуємо символьний рядок (з пробілами)
	
	istringstream iss(str); // записуємо символьний рядок у потік

    while (iss >> word) // зчитуємо слова з потоку
        words.push_back(word); // записуємо слова у вектор, прибираючи пунктуацію
	
	SetColor(0, 2);
	for(i = 0; i < words.size(); i++) {
		word = words.at(i); // проходимося по словам та перевіряємо їх на наявність букви на 5-й позиції
		if (word.length() >= 4 && !isalpha(word[4]) && !ispunct(word[4])) word[4] = '5';
		cout << word << " "; 
	}
    
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
