/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №6
Завдання 4
Тема лабораторної роботи: Розв’язання задач обробки елементів одновимірних числових масивів.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ для модифікації 
елементів одновимірного масиву відповідно до індивідуального завдання у таблиці 6.4. Елементи 
вхідного масиву ввести з клавіатури. Модифікацію елементів заданого одновимірного масиву 
необхідно проводити без використання додаткових масивів. Елементи вхідного та модифікованого 
масивів необхідно вивести на очищений екран. Результат вивести різними кольорами.
У заданому масиві замінити додатні елементи їх індексами.
*/

#include <iostream>
#include <windows.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */	
	int n, i;
	
	SetColor(11, 1);
	cout << "Введіть кількість елементів масиву: ";
	cin >> n;
	
	int arr[n];
	
	SetColor(9, 15);
	cout << "Введіть елементи масиву:" << endl;
	for (i = 0; i < n; i++) { // вводимо елементи вхідного масиву
		cout << i << ") ";
		cin >> arr[i];
	}
	
	SetColor(0, 2);
	cout << "Вхідний масив:       ";
	for (i = 0; i < n; i++) { // друкуємо вхідний масив
		cout << arr[i] << " ";
	}
	
	// друкуємо модифікований масив, паралельно змінюючи його додатні елементи на
	// індекси цих елементів
	SetColor(0, 10);
	cout << "\nМодифікований масив: ";
	for (i = 0; i < n; i++) {
		if (arr[i] > 0) arr[i] = i;
		cout << arr[i] << " ";
	}
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
