/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №1
Завдання 2
Тема лабораторної роботи: Розв'язання задач лінійної структури.
Завдання: Розробити алгоритм для розв'язання індивідуальних задач та реалізувати його 
мовою С\С++ відповідно індивідуального завдання, що наведено у таблиці 1.2. Результат 
вивести різними кольорами.
*/

#include <iostream>
#include <math.h>
#include <stdio.h>
#include <windows.h>

#define _USE_MATH_DEFINES // підключення вбудованих математичних констант

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

// Функція, призначена для визначення позиції курсору на екрані за координатами x, y
void gotoxy(int x, int y) {
	// змінна, яка позначає нову позицію курсору на екрані виводу
	COORD coordinates;
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	coordinates.X = x; coordinates.Y = y;
	// задання позиції курсору на екрані
	SetConsoleCursorPosition(hStdOut, coordinates);
}


int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	// зміна кольору тла і тексту на екрані виводу (тут відповідно - чорний і білий)
	system("color 07"); 
	
	/*Програмний код для розв'язку поставленого завдання*/
	
	// наступні 3 змінні визначають: радіус основи, висоту та об'єм конуса
	double r, h, v;
	
	// введемо перші дві змінні з консолі
	cout << "Введіть радіус основи конуса: ";
	cin >> r;
	cout << "Введіть висоту конуса: ";
	cin >> h;
	
	// обчислимо об'єм конуса за формулою
	v = (1.0/3.0) * M_PI * pow(r, 2) * h;
	
	// виводимо результат у консоль зеленим кольором 
	SetColor(2, 0);
	printf("Площа конуса: %0.3f\n", v);
	
	// наступні 2 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	system("pause");
	
	return 0;
}
