/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №7
Завдання 2
Тема лабораторної роботи: Розв'язання задач обробки елементів числових матриць.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ для роботи з тривимірним 
масивом відповідно до індивідуального завдання у таблиці 7.2. Результат вивести різними кольорами. 
В заданому тривимірному масиві підрахувати суму усіх від'ємних елементів.
*/

#include <time.h>
#include <stdlib.h>
#include <iostream>
#include <stdio.h>
#include <windows.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */

	srand(time(NULL)); 
	 
	// наступні 5 змінних позначають: кі-сть двовимірних масивів у тривимірному масиві, кі-сть рядків 
	// двовимірного масива, к-ість стовпчиків двовимірного масива, тривимірний масив, суму його від'ємних елементів
	int n = 1 + rand()%3, m = 3 + rand()%5, l = 3 + rand()%5;
	int mas[n][m][l];
	int neg_sum = 0;
	int i, j, k;
	
	SetColor(11, 1);
	printf("Тривимірний масив mas(%d, %d, %d):\n", n, m, l);
	
	// ініціалізуємо елементи тривимірного масиву та друкуємо їх
	for (i = 0; i < n; i++) { 
		for (j = 0; j < m; j++) { // заповнюємо двовимірний масив
			for (k = 0; k < l; k++) { // заповнюємо рядок двовимірного масиву та друкуємо його
				mas[i][j][k] = 40 - rand()%50;
				cout << mas[i][j][k] << " ";
				
				if (mas[i][j][k] < 0) neg_sum += mas[i][j][k]; 
			}
			cout << endl;			
		}	
		cout << "\n";	
	}
	
	SetColor(0, 2);
	cout << "\nСума від'ємних елементів: " << neg_sum << endl;
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
