/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №6
Завдання 2
Тема лабораторної роботи: Розв’язання задач обробки елементів одновимірних числових масивів.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ для формування 
елементів нового одновимірного масиву із елементів вхідного одновимірного масиву відповідно 
до індивідуального завдання, заданого у таблиці 6.2. Результат вивести різними кольорами.
Сформувати новий масив з елементів вхідного масиву, що кратні п’яти.
*/

#include <time.h>
#include <stdlib.h>
#include <iostream>
#include <windows.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	// srand - функція, призначена для встановлення початкової точки, з якої відбувається 
	// генерація випадкових чисел. При виклику функції time() з параметром NULL, 
	// повернеться к-сть мілісекунд, які пройшли з 1 січня 1970 року до моменту, коли 
	// користувач запустив програму
	srand(time(NULL));
	
	// наступі 2 змінні позначають кі-сть елементів масиву, вхідний і новий масив
	int n = 5 + rand()%15;
	int arr[n], arr1[n];
	int i;
	
	SetColor(11, 1);
	cout << "Вхідний масив: ";
	
	// друкуємо вхідний масив, паралельно ініціалізуючи його елементи та елементи нового масиву
	for (i = 0; i < n; i++) {  
		arr[i] = 0 + rand()%50;
		arr1[i] = -1;
		cout << arr[i] << " ";
		
		// ініціалізуємо новий масив елементами з вхідного масиву, що кратні 5
		if (arr[i] % 5 == 0) arr1[i] = arr[i];	
	}
	
	SetColor(0, 2);
	cout << "\nНовий масив: ";
	
	for (i = 0; i < n; i++)  // друкуємо новий масив
		if (arr1[i] >= 0)
			cout << arr1[i] << " ";
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
