/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №3
Завдання 1
Тема лабораторної роботи: Розв'язання задач з використанням циклу з параметром.
Завдання: Розробити алгоритм для підрахунку сум та добутків, відповідно до індивідуального завдання, 
що наведено у таблиці 3.1, та реалізувати його мовою С\С++ з використанням циклу з параметром FOR. 
Значення параметрів та змінних для обрахунків сум та добутків задавати з клавіатури. 
Результат вивести різними кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	double i, j, start_i, end_i, start_j, end_j, f, s = 0.0;
	
	SetColor(11, 1);
	cout << "Введіть початкове значення і: ";
	cin >> start_i;
	cout << "Bведіть кінцеве значення і: ";
	cin >> end_i;
	cout << "Введіть початкове значення j: ";
	cin >> start_j;
	cout << "Bведіть кінцеве значення j: ";
	cin >> end_j;
	
	for (i = end_i; i >= start_i; i--) {
		f = 1.0; // ініціалізуємо змінну для результату множення
		
		for (j = end_j; j >= start_j; j--) {
			f *= (2.0 * i) / powf(j, 2.0);
		}
		s += powf(f, i);

		cout << "s = " << s << endl;
	}
	
	SetColor(0, 4);
	printf("S = %10.5f\n", s);
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
