/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №2
Завдання 1
Тема лабораторної роботи: Розв'язання задач розгалуженої структури.
Завдання: Розробити алгоритм для розв'язання індивідуальних задач та реалізувати його мовою 
С\С++ відповідно до індивідуального завдання, що наведено у таблиці 2.1. Необхідно розробити 
два варіанта реалізації задачі з використанням умовного оператора та тернарного оператора. 
Результат вивести різними кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	// зміна кольору тла і тексту на екрані виводу (тут відповідно - чорний і білий)
	system("color 07"); 
	
	/* Програмний код для розв'язку поставленого завдання */
	
	double x, Y;
	int choice; // змінна для вибору варіанту виконання задачі
	
	tryAgain: // мітка для переходу за оператором goto (якщо вибір варіанту невірний)
		SetColor(15, 8);
		cout << "1) Використання умовного оператора                   " << endl;
		cout << "2) Bикористання тернарного оператора                 " << endl;
		cout << "Виберіть варіант виконання задачі (введіть 1 або 2): ";
		cin >> choice;
		
		/*Варіант 1 (використання умовного оператора)*/
		if (choice == 1) {
			SetColor(0, 7);
			cout << "Введіть x: ";
			cin >> x;
			
			if (x > 0 && x < 1) 
				Y = 120;
			else 
				if (x > 4.0) 
					Y = 5.0*powf(x, 2.0);
				else 
					Y = powf(x, 2.0) + 10.0;
					
			SetColor(14, 2);
			printf("Y = %5.1f", Y);
		
		/*Варіант 2 (використання тернарного оператора)*/
		} else if (choice == 2) {
			SetColor(0, 7);
			cout << "Введіть x: ";
			cin >> x;
			
			Y = (x > 0 && x < 1) ? 120 : (x > 4.0) ? 5.0*powf(x, 2.0) : powf(x, 2.0) + 10.0;
			
			SetColor(14, 2);
			printf("Y = %5.1f", Y);
		
		} else {
			SetColor(0, 4);
			cout << "\nВи зробили неправильний вибір! Спробуйте ще раз\n";
			goto tryAgain; // якщо вибір варіанту виконання невірний, переходимо на мітку tryAgain та вибираємо варіант спочатку
		}
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
