/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №7
Завдання 4
Тема лабораторної роботи: Розв'язання задач обробки елементів числових матриць.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ для обробки 
елементів у визначеній частині матриці відповідно до індивідуального завдання у таблиці 
7.4. Результат вивести різними кольорами.
У зафарбованій частині матриці підрахувати кількість елементів, що містять дві цифри.
*/

#include <time.h>
#include <stdlib.h>
#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <cmath>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	srand(time(NULL)); 
	
	// наступні 4 змінні позначають: кі-сть рядків матриці, кі-сть стовпчиків, саму матрицю, 
	// кі-сть елементів, що містять дві цифри
	int n = 3 + rand()%3, m = n;
	int matrix[n][m];
	int amount = 0;
	int i, j;
	
	SetColor(11, 1);
	printf("Матриця matrix(%d, %d):\n", n, m);
	
	// ініціалізуємо елементи матриці та друкуємо їх
	for (i = 0; i < n; i++) { 
		for (j = 0; j < m; j++) { // заповнюємо рядок
			matrix[i][j] = 40 - rand()%50;
			SetColor(11, (j==n-i-1 ? 4 : 1));
			cout << matrix[i][j] << " ";
		}
		cout << endl;		
	}
	
	// визначаємо кі-сть елементів, що містять дві цифри
	for (i = n; i > 0; i--) {
		for (j = n-i; j < m; j++) {
			int len = trunc(log10(matrix[i][j]))+1; // кі-сть цифр у числі
			if (len == 2) amount++;	
		}
	}
	
	SetColor(0, 2);
	cout << "Кількість елементів, що містять дві цифри: " << amount << endl;
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
