/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №1
Завдання 3
Тема лабораторної роботи: Розв'язання задач лінійної структури.
Завдання: Розробити алгоритм для обчислення величин, що задані виразами, та реалізувати
його мовою С\С++ відповідно варіанту індивідуального завдання, що наведено у таблиці 1.3.
*/

#include <iostream>
#include <math.h>
#include <stdio.h>
#include <windows.h>

#define _USE_MATH_DEFINES // підключення вбудованих математичних констант

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

// Функція, призначена для визначення позиції курсору на екрані за координатами x, y
void gotoxy(int x, int y) {
	// змінна, яка позначає нову позицію курсору на екрані виводу
	COORD coordinates;
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	coordinates.X = x; coordinates.Y = y;
	// задання позиції курсору на екрані
	SetConsoleCursorPosition(hStdOut, coordinates);
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	// зміна кольору тла і тексту на екрані виводу (тут відповідно - чорний і білий)
	system("color 07"); 
	
	/*Програмний код для розв'язку поставленого завдання*/
	
	double x, y; // величини, значення яких задається користувачем
	double Z1, Z2, Z3; // величини які потрібно знайти
	
	// введемо х та у з консолі
	cout << "Введіть x: ";
	cin >> x;
	cout << "Введіть y: ";
	cin >> y;
	
	// обчислення невідомих величин Z1, Z2, Z3
	Z1 = ((y + pow(sin(x), 2)) / pow(x-y, 7)) + 5.0*y;
	Z2 = (pow(x, 2) + pow(cos(0.7 * x), -4)) - 15.0;
	Z3 = fabs((Z1 - 10.0) / Z2);
	
	// Виведемо значення Z1 зеленим кольором на чорному тлі
	SetColor(2, 0);
	printf("Z1: %0.3f\n", Z1);
	
	// Виведемо значення Z2 білим кольором на синьому тлі
	SetColor(7, 1);
	printf("Z2: %0.3f\n", Z2);
	
	// Виведемо значення Z3 червоним кольором на зеленому тлі
	SetColor(4, 2);
	printf("Z3: %0.3f\n", Z3);
		
	// наступні 2 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	system("pause");
	
	return 0;
}
