/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №5
Завдання 1
Тема лабораторної роботи: Розв'язання задач з використанням циклу з післяумовою.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ з використанням 
циклу з параметром DO – WHILE для розв’язку індивідуального завдання у таблиці 5.1. 
Введене число повинно бути цілим та в діапазоні [1, 10000000]. Результат вивести різними 
кольорами. Ввести ціле число і визначити чи серед цифр числа немає жодного нуля.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}


int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	int x, s=0;
	
	tryAgain: // мітка, перехід до якої відбувається в разі, якщо x не належить діапазону [1, 10000000]
		SetColor(11, 1);
		cout << "Введіть ціле число у діапазоні [1, 10000000]: ";
		cin >> x;
	
	if (x < 1 || x > 10000000) {
		// якщо якщо x не належить діапазону [1, 10000000], переходимо до мітки tryAgain 
		SetColor(15, 4);
		cout << "Значення x не належить діапазону [1, 10000000]! Спробуйте ще раз\n" << endl;
		goto tryAgain;
	} else {
		do { // рахуємо кількість нулів
			s += !(x % 10);
			x /= 10;
			cout << x << endl;
		} while (x);
		
		SetColor(0, (s == 0 ? 2 : 4));
		cout << (s == 0 ? "У числі нема жодного нуля" : "У числі є нулі") << endl;
	}
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
