/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №6
Завдання 1
Тема лабораторної роботи: Розв’язання задач обробки елементів одновимірних числових масивів.
Завдання: Розробити блок-схему алгоритму та реалізувати його мовою С\С++ для розв’язку 
індивідуального завдання, заданого у таблиці 6.1. Результат вивести різними кольорами.
Обчислити та вивести суму індексів парних елементів вхідного масиву.
*/

#include <time.h>
#include <stdlib.h>
#include <iostream>
#include <windows.h>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	// srand - функція, призначена для встановлення початкової точки, з якої відбувається 
	// генерація випадкових чисел. При виклику функції time() з параметром NULL, 
	// повернеться к-сть мілісекунд, які пройшли з 1 січня 1970 року до моменту, коли 
	// користувач запустив програму
	srand(time(NULL)); 
	
	// наступі 3 змінні позначають суму індексів парних елементів, кі-сть елементів масиву,
	// сам масив
	int s = 0, n = 5 + rand()%15;
	int arr[n];
	int i;
	
	SetColor(11, 1);
	cout << "Вхідний масив: ";
	
	for (i = 0; i < n; i++) { // друкуємо вхідний масив, паралельно ініціалізуючи його елементи
		arr[i] = 0 + rand()%50;
		cout << arr[i] << " ";
		
		if (arr[i] % 2 == 0) s += i; // знаходимо парні елементи та сумуємо їх індекси
	}
	
	SetColor(0, 2);
	cout << "\nСума індексів парних елементів: " << s << endl;
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
