/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №3
Завдання 3
Тема лабораторної роботи: Розв'язання задач з використанням циклу з параметром.
Завдання: Розробити алгоритм для виконання індивідуального завдання, що наведено у 
таблиці 3.3, та реалізувати його мовою С\С++ з використанням циклу з параметром FOR. 
Результат вивести різними кольорами. Згідно з номером варіанту, необхідно вивести усі 
тризначні числа в заданому діапазоні та визначену їх кількість.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <cmath>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	// настурні три змінні позначають відповідно: нижня та верхня межі діапазону, 
	// кількість трицифрових чисел у заданому діапазоні
	int a, b, amount = 0;
	
	tryAgain: // мітка, перехід до якої відбувається в разі, якщо верхня межа < нижньої
		SetColor(15, 6);
		cout << "Введіть нижню межу діапазону: ";
		cin >> a;
		cout << "Введіть верхню межу діапазону: ";
		cin >> b;
	
	if (a > b) {
		// якщо верхня межа < нижньої, переходимо до мітки tryAgain та вводимо значення меж знову 
		SetColor(15, 4);
		cout << "Верхня межа діапазону не може бути більше верхньої! Спробуйте ще раз\n" << endl;
		goto tryAgain;
	}
	
	// визначаємо кількість цифр у числових значеннях меж діапазону [a, b] за допомогою функції trunc
	int a_len = trunc(log10(a)) + 1;
	int b_len = trunc(log10(b)) + 1;
		
	if (a_len >= 3 || b_len >= 3) {
		SetColor(0, 3);

		for (int i = a; i<=b; i++) {
			int i_len = trunc(log10(i)) + 1; // визначаємо кількість цифр у числі
			
			if (i_len == 3) {
				printf("x = %d\n", i);
				amount++;
			}
		}
		
		SetColor(15, 2);
		printf("Кількість трицифрових чисел: %d", amount);
		
	} else {
		SetColor(15, 4);
		printf("У межах діапазону немає трицифрових чисел");
	}
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
