/*
Група: KH–1-2
Здобувач: Качур Антон Вікторович
Лабораторна робота №5
Завдання 3
Тема лабораторної роботи: Розв'язання задач з використанням циклу з післяумовою.
Завдання: Розробити блок-схему алгоритму для табулювання функції та реалізувати його мовою C\C++, 
з використанням циклу DO - WHILE, відповідно до варіанта індивідуального завдання, що наведено 
у таблиці 5.3. Забезпечити введення значень параметрів проміжку, на якому буде здійснено табулювання 
функції, а також кроку зміни аргументу. Результат вивести різними кольорами.
*/

#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <math.h>
#include <iomanip>

using namespace std;

// Функція, призначена для зміни кольору виводу. 
// В якості аргументів передаються числові значення кольорів тексту і тла
void SetColor(int text, int background) {
	// змінна, яка позначає дескриптор екрану консолі виводу
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	// присвоєння значень кольорів тексту, який виводиться в консоль
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}

// Функція, призначена для виводу n-го числа -
void dashes(int n) {
	for (int i = 0; i < n; i++)
		cout << "-";
		
	cout << endl;
}

int main() {
	system("cls"); // викликаємо функцію очистку екрану
	// наступні дві команди призначено для відображення кирилиці у 
	// консольному вікні
	// встановлення кодової сторінки win-cp 1251 для потоку введення
	SetConsoleCP(1251); 
	// встановлення кодової сторінки win-cp 1251 до потоку виведення
	SetConsoleOutputCP(1251);
	
	/* Програмний код для розв'язку поставленого завдання */
	
	double x, xstart, xend, xstep, y, b;
	
	SetColor(11, 1);
	cout << "Введіть початкове значення x: ";
	cin >> xstart;
	cout <<"Введіть кінцеве значення x: ";
	cin >> xend;
	cout <<"Введіть значення зміни x: ";
	cin >> xstep;
	cout <<"Введіть значення b: ";
	cin >> b;
	
	// виводимо таблицю
	SetColor(15, 8);
	dashes(24);
	cout << setw(8) << "x " << "| ";
	cout << setw(13) << "y " << "|" << endl;
	dashes(24);
	
	x = xstart;
	
	do {
		if (x > b) {
			y = powf(x-b, 3.0) + tan(x);
		} else if (x < b) {
			y = powf(b-x, 3.0) + tan(x);
		} else {
			y = powf(2.0*x, 3.0) + 0.5;
		}
	
		cout << setprecision(4) << setw(7) << fixed << x << " | ";
		cout << setw(12) << fixed << y << " |" << endl;
		x+=xstep;
	} while (x <= xend);
	
	// наступні 3 рядки демонструють встановлення стандартних кольорів тексту і тла та
	// призупинення роботи програми
	SetColor(7, 0);
	cout << "\n";
	system("pause");
	
	return 0;
}
